{
  "layers" : [
    {
      "bottom" : "input_ids",
      "axis_mode" : 31,
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "sum_prompt",
      "use_version" : 1,
      "top" : "prompt_sum",
      "type" : "reduce",
      "name" : "sum_prompt",
      "attributes" : {
        "basic_block_head" : 1
      }
    },
    {
      "bottom" : "prompt_sum",
      "weights" : {

      },
      "debug_info" : "copy_next_token",
      "top" : "next_token",
      "type" : "copy",
      "name" : "copy_next_token",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "bottom" : "prompt_sum",
      "weights" : {

      },
      "debug_info" : "copy_kv_cache",
      "top" : "kv_cache",
      "type" : "copy",
      "name" : "copy_kv_cache",
      "attributes" : {
        "is_output" : 1
      }
    }
  ],
  "storage" : "model.espresso.weights",
  "metadata_in_weights" : [

  ],
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 300,
  "shape" : {
    "layer_shapes" : {
      "kv_cache" : {
        "k" : 1,
        "w" : 1,
        "n" : 1,
        "_rank" : 1,
        "h" : 1
      },
      "prompt_sum" : {
        "k" : 1,
        "w" : 1,
        "n" : 1,
        "_rank" : 1,
        "h" : 1
      },
      "next_token" : {
        "k" : 1,
        "w" : 1,
        "n" : 1,
        "_rank" : 1,
        "h" : 1
      },
      "input_ids" : {
        "k" : 1,
        "w" : 4,
        "n" : 1,
        "_rank" : 1,
        "h" : 1
      }
    },
    "global_shapes" : {

    }
  },
  "subnetworks" : {

  }
}